cmsis-svd/cmsis-svd/data/Spansion/MB9BF32xT_svd.xml
        <!-- REGISTER "COMP2" -->
        <register>
          <name>COMP2</name>
          <description> register COMP2 </description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "COMP4" -->
        <register derivedFrom="COMP0">
          <name>COMP4</name>
          <description> register COMP4 </description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "COMP6" -->
        <register derivedFrom="COMP2">
          <name>COMP6</name>
          <description> register COMP6 </description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "TRG" -->
        <register>
          <name>TRG</name>
          <description> register TRG </description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEN07" -->
            <field>
              <name>PEN07</name>
              <description> bitfield PEN07 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN06" -->
            <field>
              <name>PEN06</name>
              <description> bitfield PEN06 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN05" -->
            <field>
              <name>PEN05</name>
              <description> bitfield PEN05 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN04" -->
            <field>
              <name>PEN04</name>
              <description> bitfield PEN04 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN03" -->
            <field>
              <name>PEN03</name>
              <description> bitfield PEN03 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN02" -->
            <field>
              <name>PEN02</name>
              <description> bitfield PEN02 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN01" -->
            <field>
              <name>PEN01</name>
              <description> bitfield PEN01 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN00" -->
            <field>
              <name>PEN00</name>
              <description> bitfield PEN00 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REVC" -->
        <register>
          <name>REVC</name>
          <description> register REVC </description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REV07" -->
            <field>
              <name>REV07</name>
              <description> bitfield REV07 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV06" -->
            <field>
              <name>REV06</name>
              <description> bitfield REV06 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV05" -->
            <field>
              <name>REV05</name>
              <description> bitfield REV05 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV04" -->
            <field>
              <name>REV04</name>
              <description> bitfield REV04 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV03" -->
            <field>
              <name>REV03</name>
              <description> bitfield REV03 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV02" -->
            <field>
              <name>REV02</name>
              <description> bitfield REV02 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV01" -->
            <field>
              <name>REV01</name>
              <description> bitfield REV01 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV00" -->
            <field>
              <name>REV00</name>
              <description> bitfield REV00 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC0" -->
        <register>
          <name>PPGC0</name>
          <description> register PPGC0 </description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description> bitfield PIE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description> bitfield PUF </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description> bitfield INTM </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description> bitfield PCS </description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description> bitfield MD </description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTRG" -->
            <field>
              <name>TTRG</name>
              <description> bitfield TTRG </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC1" -->
        <register derivedFrom="PPGC0">
          <name>PPGC1</name>
          <description> register PPGC1 </description>
          <addressOffset>0x200</addressOffset>
        </register>
