cmsis-svd/cmsis-svd/data/Spansion/MB9BF32xT_svd.xml
        <!-- REGISTER "DDR7" -->
        <register derivedFrom="PFR7">
          <name>DDR7</name>
          <description> register DDR7 </description>
          <addressOffset>0x21C</addressOffset>
        </register>
        <!-- REGISTER "DDR8" -->
        <register derivedFrom="PFR8">
          <name>DDR8</name>
          <description> register DDR8 </description>
          <addressOffset>0x220</addressOffset>
        </register>
        <!-- REGISTER "DDR9" -->
        <register derivedFrom="PFR9">
          <name>DDR9</name>
          <description> register DDR9 </description>
          <addressOffset>0x224</addressOffset>
        </register>
        <!-- REGISTER "DDRA" -->
        <register derivedFrom="PFRA">
          <name>DDRA</name>
          <description> register DDRA </description>
          <addressOffset>0x228</addressOffset>
        </register>
        <!-- REGISTER "DDRB" -->
        <register derivedFrom="PFRB">
          <name>DDRB</name>
          <description> register DDRB </description>
          <addressOffset>0x22C</addressOffset>
        </register>
        <!-- REGISTER "DDRC" -->
        <register derivedFrom="PFRC">
          <name>DDRC</name>
          <description> register DDRC </description>
          <addressOffset>0x230</addressOffset>
        </register>
        <!-- REGISTER "DDRD" -->
        <register derivedFrom="PFRD">
          <name>DDRD</name>
          <description> register DDRD </description>
          <addressOffset>0x234</addressOffset>
        </register>
        <!-- REGISTER "DDRE" -->
        <register derivedFrom="PFRE">
          <name>DDRE</name>
          <description> register DDRE </description>
          <addressOffset>0x238</addressOffset>
        </register>
        <!-- REGISTER "DDRF" -->
        <register derivedFrom="PFRF">
          <name>DDRF</name>
          <description> register DDRF </description>
          <addressOffset>0x23C</addressOffset>
        </register>
        <!-- REGISTER "PDIR0" -->
        <register derivedFrom="DDR0">
          <name>PDIR0</name>
          <description> register PDIR0 </description>
          <addressOffset>0x300</addressOffset>
        </register>
        <!-- REGISTER "PDIR1" -->
        <register derivedFrom="DDR1">
          <name>PDIR1</name>
          <description> register PDIR1 </description>
          <addressOffset>0x304</addressOffset>
        </register>
        <!-- REGISTER "PDIR2" -->
        <register derivedFrom="DDR2">
          <name>PDIR2</name>
          <description> register PDIR2 </description>
          <addressOffset>0x308</addressOffset>
        </register>
        <!-- REGISTER "PDIR3" -->
        <register derivedFrom="DDR3">
          <name>PDIR3</name>
          <description> register PDIR3 </description>
          <addressOffset>0x30C</addressOffset>
        </register>
        <!-- REGISTER "PDIR4" -->
        <register derivedFrom="DDR4">
          <name>PDIR4</name>
          <description> register PDIR4 </description>
          <addressOffset>0x310</addressOffset>
        </register>
        <!-- REGISTER "PDIR5" -->
        <register derivedFrom="DDR5">
          <name>PDIR5</name>
          <description> register PDIR5 </description>
          <addressOffset>0x314</addressOffset>
        </register>
        <!-- REGISTER "PDIR6" -->
        <register derivedFrom="DDR6">
          <name>PDIR6</name>
          <description> register PDIR6 </description>
          <addressOffset>0x318</addressOffset>
        </register>
        <!-- REGISTER "PDIR7" -->
        <register derivedFrom="DDR7">
          <name>PDIR7</name>
          <description> register PDIR7 </description>
          <addressOffset>0x31C</addressOffset>
        </register>
        <!-- REGISTER "PDIR8" -->
        <register derivedFrom="DDR8">
          <name>PDIR8</name>
          <description> register PDIR8 </description>
          <addressOffset>0x320</addressOffset>
        </register>
        <!-- REGISTER "PDIR9" -->
        <register derivedFrom="DDR9">
          <name>PDIR9</name>
          <description> register PDIR9 </description>
          <addressOffset>0x324</addressOffset>
        </register>
        <!-- REGISTER "PDIRA" -->
        <register derivedFrom="DDRA">
          <name>PDIRA</name>
          <description> register PDIRA </description>
          <addressOffset>0x328</addressOffset>
        </register>
        <!-- REGISTER "PDIRB" -->
        <register derivedFrom="DDRB">
          <name>PDIRB</name>
          <description> register PDIRB </description>
          <addressOffset>0x32C</addressOffset>
        </register>
        <!-- REGISTER "PDIRC" -->
        <register derivedFrom="DDRC">
          <name>PDIRC</name>
          <description> register PDIRC </description>
          <addressOffset>0x330</addressOffset>
        </register>
        <!-- REGISTER "PDIRD" -->
        <register derivedFrom="DDRD">
          <name>PDIRD</name>
          <description> register PDIRD </description>
          <addressOffset>0x334</addressOffset>
        </register>
        <!-- REGISTER "PDIRE" -->
        <register derivedFrom="DDRE">
          <name>PDIRE</name>
          <description> register PDIRE </description>
          <addressOffset>0x338</addressOffset>
        </register>
        <!-- REGISTER "PDIRF" -->
        <register derivedFrom="DDRF">
          <name>PDIRF</name>
          <description> register PDIRF </description>
          <addressOffset>0x33C</addressOffset>
        </register>
        <!-- REGISTER "PDOR0" -->
        <register derivedFrom="DDR0">
          <name>PDOR0</name>
          <description> register PDOR0 </description>
          <addressOffset>0x400</addressOffset>
        </register>
        <!-- REGISTER "PDOR1" -->
        <register derivedFrom="DDR1">
          <name>PDOR1</name>
          <description> register PDOR1 </description>
          <addressOffset>0x404</addressOffset>
        </register>
        <!-- REGISTER "PDOR2" -->
        <register derivedFrom="DDR2">
          <name>PDOR2</name>
          <description> register PDOR2 </description>
          <addressOffset>0x408</addressOffset>
        </register>
        <!-- REGISTER "PDOR3" -->
        <register derivedFrom="DDR3">
          <name>PDOR3</name>
          <description> register PDOR3 </description>
          <addressOffset>0x40C</addressOffset>
        </register>
        <!-- REGISTER "PDOR4" -->
        <register derivedFrom="DDR4">
          <name>PDOR4</name>
          <description> register PDOR4 </description>
          <addressOffset>0x410</addressOffset>
        </register>
        <!-- REGISTER "PDOR5" -->
        <register derivedFrom="DDR5">
          <name>PDOR5</name>
          <description> register PDOR5 </description>
          <addressOffset>0x414</addressOffset>
        </register>
