cmsis-svd/cmsis-svd/data/Spansion/MB9BF32xT_svd.xml
        <!-- REGISTER "EP0IS" -->
        <register>
          <name>EP0IS</name>
          <description> register EP0IS </description>
          <addressOffset>0x2144</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8400</resetValue>
          <resetMask>0xC400</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description> bitfield BFINI </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIIE" -->
            <field>
              <name>DRQIIE</name>
              <description> bitfield DRQIIE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQI" -->
            <field>
              <name>DRQI</name>
              <description> bitfield DRQI </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP0OS" -->
        <register>
          <name>EP0OS</name>
          <description> register EP0OS </description>
          <addressOffset>0x2148</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xE67F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description> bitfield BFINI </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQOIE" -->
            <field>
              <name>DRQOIE</name>
              <description> bitfield DRQOIE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description> bitfield SPKIE </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQO" -->
            <field>
              <name>DRQO</name>
              <description> bitfield DRQO </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description> bitfield SPK </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description> bitfield SIZE </description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP1S" -->
        <register>
          <name>EP1S</name>
          <description> register EP1S </description>
          <addressOffset>0x214C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xEFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description> bitfield BFINI </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIE" -->
            <field>
              <name>DRQIE</name>
              <description> bitfield DRQIE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description> bitfield SPKIE </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description> bitfield BUSY </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRQ" -->
            <field>
              <name>DRQ</name>
              <description> bitfield DRQ </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description> bitfield SPK </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description> bitfield SIZE </description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP2S" -->
        <register>
          <name>EP2S</name>
          <description> register EP2S </description>
          <addressOffset>0x2150</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xEFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description> bitfield BFINI </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIE" -->
            <field>
              <name>DRQIE</name>
              <description> bitfield DRQIE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description> bitfield SPKIE </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description> bitfield BUSY </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRQ" -->
            <field>
              <name>DRQ</name>
              <description> bitfield DRQ </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description> bitfield SPK </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description> bitfield SIZE </description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP3S" -->
        <register derivedFrom="EP2S">
          <name>EP3S</name>
          <description> register EP3S </description>
          <addressOffset>0x2154</addressOffset>
        </register>
        <!-- REGISTER "EP4S" -->
        <register derivedFrom="EP2S">
          <name>EP4S</name>
          <description> register EP4S </description>
          <addressOffset>0x2158</addressOffset>
        </register>
        <!-- REGISTER "EP5S" -->
        <register derivedFrom="EP2S">
          <name>EP5S</name>
          <description> register EP5S </description>
          <addressOffset>0x215C</addressOffset>
        </register>
